In [2]:
#Loading Libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df=pd.read_csv('dataset_group.csv')

In [4]:
df.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

In [5]:
df.shape

(20641, 3)

In [6]:
df.nunique()

Date         603
Order_id    1139
Product       37
dtype: int64

In [7]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [15]:
df.describe()

           Order_id
count  20641.000000
mean     575.986289
std      328.557078
min        1.000000
25%      292.000000
50%      581.000000
75%      862.000000
max     1139.000000

In [9]:
df.duplicated().sum()

4730

In [10]:
df.isna().sum()

Date        0
Order_id    0
Product     0
dtype: int64